In [1]:
import pandas as pd

In [2]:
# series
s = pd.Series([1, 2, 3, 4], index=["a", "b", "c", "d"])
s

a    1
b    2
c    3
d    4
dtype: int64

In [3]:
# Data frame
data = {'Name': ['Alice', 'Bob'], 'Age':[25,30]}
df = pd.DataFrame(data)
df

    Name  Age
0  Alice   25
1    Bob   30

In [4]:
test = pd.read_csv("test.csv")
# test.head(10)
df = pd.DataFrame(test)
# df

In [5]:
#inspecting data
# df.head(2)
# df.tail(4)
# df.info()
# df.shape
# df.describe()

In [6]:
# selecting data

# df["Survived"]  # selecting collum
# df.iloc[0] # used to acces data with index
# df.Name(LABEL)

In [7]:
# slicing rows

# df[12:13]

In [8]:
# filtering data

# df[df["Age"] > 65]
# df[(df["Age"] > 20 ) & (df["Name"] == "Straus, Mr. Isidor")]

In [9]:
import numpy as np

data_2 = {
    "Name": ["Alice", "Bob", "Charlie", "David", "Eve", "Alice"],
    "Age": [25, 30, 35, np.nan, 29, 25],
    "Department": ["HR", "IT", "Finance", "IT", "HR", "HR"],
    "Salary": [50000, 60000, 70000, 62000, np.nan, 50000]
}

df_2 = pd.DataFrame(data_2)
df_2

      Name   Age Department   Salary
0    Alice  25.0         HR  50000.0
1      Bob  30.0         IT  60000.0
2  Charlie  35.0    Finance  70000.0
3    David   NaN         IT  62000.0
4      Eve  29.0         HR      NaN
5    Alice  25.0         HR  50000.0

In [10]:
# Handling Missing Data ***
# df_2.isnull().sum()
# df_2.dropna(how="any")
# df_2["Salary"].fillna(method= "ffill")

In [ ]:
# adding / modifying collums

# df_2["Alary"] = df_2["Age"] * df_2["Salary"]
# df_2

In [ ]:
# grouping & aggregation

      Name   Age Department   Salary      Alary
0    Alice  25.0         HR  50000.0  1250000.0
1      Bob  30.0         IT  60000.0  1800000.0
2  Charlie  35.0    Finance  70000.0  2450000.0
3    David   NaN         IT  62000.0        NaN
4      Eve  29.0         HR      NaN        NaN
5    Alice  25.0         HR  50000.0  1250000.0